namespace Tasks;

public static class Tasks5
{
    // TODO: Создать и реализовать метод, принимающий строку, и возвращающий true, если эта строка является палиндромом
    // (то есть читается одинаково в обе стороны) и false в обратном случае
    
    // TODO: Создать и реализовать метод, принимающий целое число (int) и возвращающий true, если это число является
    // простым (делится только на 1 и на само себя) и false в обратном случае
    
    // TODO: Создать и реализовать метод, принимающий строку и возвращающий количество гласных букв в этой строке
    // Текст принимается английский, проверка на буквы a, e, i, o, u (без 'y')
    
    // TODO: Создать и реализовать метод, принимающий строку и возвращающий количество слов в этой строке
}