namespace Tasks;

// Создать класс Point2D, хранящий в себе значения координат X и Y.
// Класс должен содержать в себе метод, принимающий другую точку и считающий расстояние до нее.

// Создать класс Rectangle, состоящий из четырех точек Point2D
// Класс должен содержать методы, считающие площадь и периметр четырехугольника
// Класс должен содержать метод, считающий площадь пересечения с другим прямоугольником
// Класс должен содержать метод, проверяющий, является ли четырехугольник квадратом
// Класс должен содержать метод, проверяющий, находится ли передаваемая в качестве аргумента точка (Point2D)
// в пределах четырехугольника