namespace Tasks;

public static class Tasks6
{
    // TODO: Создать и реализовать метод, принимающий на вход словарь и выводящий его в консоль в формате
    // { ключ = значение; ключ = значение; ключ = значение }
    
    // TODO: Создать и реализовать метод, принимающий на вход строку и считающий с помощью словаря количество каждого
    // символа в этой строке. Затем необходимо найти символ, встречающийся наибольшее количество раз и вернуть
    // KeyValuePair с этим символом и его количеством
    
    // TODO: Создать и реализовать метод, принимающий на вход список элементов любого типа и возвращающий количество
    // элементов этого списка, не считая повторяющиеся
    // {1, 2, 3, 4, 4, 3, 2, 0} => 5
}